read_verilog SRC/fir_filter.v
synth
dfflibmap -liberty ../gscl45nm.lib
abc -liberty ../gscl45nm.lib
opt
stat -liberty ../gscl45nm.lib
